

##対象解除法について（簡単版）
ひとつの解には、盤面を90度・180度・270度回転、及びそれらの鏡像の合計8個の対称解が存在します。

```
  １２ ４１ ３４ ２３
  ４３ ３２ ２１ １４

  ２１ １４ ４３ ３２
  ３４ ２３ １２ ４１
```

上図左上がユニーク解です。
```
  １２ 
  ４３ 
```

１行目はユニーク解を90度、180度、270度回転したものです。
```
  １２ ４１ ３４ ２３
  ４３ ３２ ２１ １４
```

2行目は1行目のそれぞれを左右反転したものです。
```
  ２１ １４ ４３ ３２
  ３４ ２３ １２ ４１
```

2行目はユニーク解を左右反転、対角反転、上下反転、逆対角反転したものとも解釈できます。
ただし、回転・線対称な解もあるので注意が必要です。

対称的な解を除去し、ユニーク解のみを求める方法はいくつかあります。

最小解選択法 
解がひとつみつかるとすべての対称解を生成、 状態を数値とみなして最も小さいもののみを解とする方法。

最小選択法よりも劣る方法
解全てを保存しておき、新しい解が発見されるたびに対称形が無いかどうかを調べる方法。
保存領域を必要とするし、比較時に対称形を生成する必要があります。



# 対象解除法
Ｎ８の場合は、92の異なる解があります。
盤面の対称性（回転や反射）で解を1つと数えると、Ｎ８の基本解は12個となります。

基本解は通常、90度、180度、270度回転し、4つの回転変形のそれぞれを定位置の鏡に映して得られる8つの変形（元の形を含む）を持っています。

参考：Ｎ２の場合
```
  １２ ４１ ３４ ２３
  ４３ ３２ ２１ １４

  ２１ １４ ４３ ３２
  ３４ ２３ １２ ４１
```

ある解が自身の90度回転と等価である場合、その基本解は2つの変形（それ自身とその反射）しか持たないことになります。
ある解が自身の90°回転とは等価ではなく、180度回転と等価である場合、4つの変形（それ自身とその反射、90°回転とその反射）を持つことになります。

解が自身の反射と等価であることは不可能です（n=1の場合を除く）。
それは、２つのクイーンが互いに向き合っていることが必要だからです。

8×8の盤上に8つのクイーンを置く問題の12の基本解のうち、ちょうど1つは自身の180°回転と等しく、1つは90°回転と等しくない。したがって、異なる解の数は118＋14＝92（ここで8は4つの90°回転位置とその反射から、4は2つの180°回転位置とその反射から得られる）である。
