// gcc BIT02.c && ./a.out ;

#include <stdio.h>

/**
 * 斜めを考慮せず、行にクイーンを一つだけ配置できるように考慮したプログラム
 */

/**
    N=5 no.1
    - - - - Q 
    - - - Q - 
    - - Q - - 
    - Q - - - 
    Q - - - - 

    N=5 no.2
    - - - - Q 
    - - - Q - 
    - - Q - - 
    Q - - - - 
    - Q - - - 

    N=5 no.3
    - - - - Q 
    - - - Q - 
    - Q - - - 
    - - Q - - 
    Q - - - - 

    N=5 no.4
    - - - - Q 
    - - - Q - 
    - Q - - - 
    Q - - - - 
    - - Q - - 

    N=5 no.5
    - - - - Q 
    - - - Q - 
    Q - - - - 
    - - Q - - 
    - Q - - - 

    N=5 no.6
    - - - - Q 
    - - - Q - 
    Q - - - - 
    - Q - - - 
    - - Q - - 

    N=5 no.7
    - - - - Q 
    - - Q - - 
    - - - Q - 
    - Q - - - 
    Q - - - - 

    N=5 no.8
    - - - - Q 
    - - Q - - 
    - - - Q - 
    Q - - - - 
    - Q - - - 

    N=5 no.9
    - - - - Q 
    - - Q - - 
    - Q - - - 
    - - - Q - 
    Q - - - - 

    N=5 no.10
    - - - - Q 
    - - Q - - 
    - Q - - - 
    Q - - - - 
    - - - Q - 

    N=5 no.11
    - - - - Q 
    - - Q - - 
    Q - - - - 
    - - - Q - 
    - Q - - - 

    N=5 no.12
    - - - - Q 
    - - Q - - 
    Q - - - - 
    - Q - - - 
    - - - Q - 

    N=5 no.13
    - - - - Q 
    - Q - - - 
    - - - Q - 
    - - Q - - 
    Q - - - - 

    N=5 no.14
    - - - - Q 
    - Q - - - 
    - - - Q - 
    Q - - - - 
    - - Q - - 

    N=5 no.15
    - - - - Q 
    - Q - - - 
    - - Q - - 
    - - - Q - 
    Q - - - - 

    N=5 no.16
    - - - - Q 
    - Q - - - 
    - - Q - - 
    Q - - - - 
    - - - Q - 

    N=5 no.17
    - - - - Q 
    - Q - - - 
    Q - - - - 
    - - - Q - 
    - - Q - - 

    N=5 no.18
    - - - - Q 
    - Q - - - 
    Q - - - - 
    - - Q - - 
    - - - Q - 

    N=5 no.19
    - - - - Q 
    Q - - - - 
    - - - Q - 
    - - Q - - 
    - Q - - - 

    N=5 no.20
    - - - - Q 
    Q - - - - 
    - - - Q - 
    - Q - - - 
    - - Q - - 

    N=5 no.21
    - - - - Q 
    Q - - - - 
    - - Q - - 
    - - - Q - 
    - Q - - - 

    N=5 no.22
    - - - - Q 
    Q - - - - 
    - - Q - - 
    - Q - - - 
    - - - Q - 

    N=5 no.23
    - - - - Q 
    Q - - - - 
    - Q - - - 
    - - - Q - 
    - - Q - - 

    N=5 no.24
    - - - - Q 
    Q - - - - 
    - Q - - - 
    - - Q - - 
    - - - Q - 

    N=5 no.25
    - - - Q - 
    - - - - Q 
    - - Q - - 
    - Q - - - 
    Q - - - - 

    N=5 no.26
    - - - Q - 
    - - - - Q 
    - - Q - - 
    Q - - - - 
    - Q - - - 

    N=5 no.27
    - - - Q - 
    - - - - Q 
    - Q - - - 
    - - Q - - 
    Q - - - - 

    N=5 no.28
    - - - Q - 
    - - - - Q 
    - Q - - - 
    Q - - - - 
    - - Q - - 

    N=5 no.29
    - - - Q - 
    - - - - Q 
    Q - - - - 
    - - Q - - 
    - Q - - - 

    N=5 no.30
    - - - Q - 
    - - - - Q 
    Q - - - - 
    - Q - - - 
    - - Q - - 

    N=5 no.31
    - - - Q - 
    - - Q - - 
    - - - - Q 
    - Q - - - 
    Q - - - - 

    N=5 no.32
    - - - Q - 
    - - Q - - 
    - - - - Q 
    Q - - - - 
    - Q - - - 

    N=5 no.33
    - - - Q - 
    - - Q - - 
    - Q - - - 
    - - - - Q 
    Q - - - - 

    N=5 no.34
    - - - Q - 
    - - Q - - 
    - Q - - - 
    Q - - - - 
    - - - - Q 

    N=5 no.35
    - - - Q - 
    - - Q - - 
    Q - - - - 
    - - - - Q 
    - Q - - - 

    N=5 no.36
    - - - Q - 
    - - Q - - 
    Q - - - - 
    - Q - - - 
    - - - - Q 

    N=5 no.37
    - - - Q - 
    - Q - - - 
    - - - - Q 
    - - Q - - 
    Q - - - - 

    N=5 no.38
    - - - Q - 
    - Q - - - 
    - - - - Q 
    Q - - - - 
    - - Q - - 

    N=5 no.39
    - - - Q - 
    - Q - - - 
    - - Q - - 
    - - - - Q 
    Q - - - - 

    N=5 no.40
    - - - Q - 
    - Q - - - 
    - - Q - - 
    Q - - - - 
    - - - - Q 

    N=5 no.41
    - - - Q - 
    - Q - - - 
    Q - - - - 
    - - - - Q 
    - - Q - - 

    N=5 no.42
    - - - Q - 
    - Q - - - 
    Q - - - - 
    - - Q - - 
    - - - - Q 

    N=5 no.43
    - - - Q - 
    Q - - - - 
    - - - - Q 
    - - Q - - 
    - Q - - - 

    N=5 no.44
    - - - Q - 
    Q - - - - 
    - - - - Q 
    - Q - - - 
    - - Q - - 

    N=5 no.45
    - - - Q - 
    Q - - - - 
    - - Q - - 
    - - - - Q 
    - Q - - - 

    N=5 no.46
    - - - Q - 
    Q - - - - 
    - - Q - - 
    - Q - - - 
    - - - - Q 

    N=5 no.47
    - - - Q - 
    Q - - - - 
    - Q - - - 
    - - - - Q 
    - - Q - - 

    N=5 no.48
    - - - Q - 
    Q - - - - 
    - Q - - - 
    - - Q - - 
    - - - - Q 

    N=5 no.49
    - - Q - - 
    - - - - Q 
    - - - Q - 
    - Q - - - 
    Q - - - - 

    N=5 no.50
    - - Q - - 
    - - - - Q 
    - - - Q - 
    Q - - - - 
    - Q - - - 

    N=5 no.51
    - - Q - - 
    - - - - Q 
    - Q - - - 
    - - - Q - 
    Q - - - - 

    N=5 no.52
    - - Q - - 
    - - - - Q 
    - Q - - - 
    Q - - - - 
    - - - Q - 

    N=5 no.53
    - - Q - - 
    - - - - Q 
    Q - - - - 
    - - - Q - 
    - Q - - - 

    N=5 no.54
    - - Q - - 
    - - - - Q 
    Q - - - - 
    - Q - - - 
    - - - Q - 

    N=5 no.55
    - - Q - - 
    - - - Q - 
    - - - - Q 
    - Q - - - 
    Q - - - - 

    N=5 no.56
    - - Q - - 
    - - - Q - 
    - - - - Q 
    Q - - - - 
    - Q - - - 

    N=5 no.57
    - - Q - - 
    - - - Q - 
    - Q - - - 
    - - - - Q 
    Q - - - - 

    N=5 no.58
    - - Q - - 
    - - - Q - 
    - Q - - - 
    Q - - - - 
    - - - - Q 

    N=5 no.59
    - - Q - - 
    - - - Q - 
    Q - - - - 
    - - - - Q 
    - Q - - - 

    N=5 no.60
    - - Q - - 
    - - - Q - 
    Q - - - - 
    - Q - - - 
    - - - - Q 

    N=5 no.61
    - - Q - - 
    - Q - - - 
    - - - - Q 
    - - - Q - 
    Q - - - - 

    N=5 no.62
    - - Q - - 
    - Q - - - 
    - - - - Q 
    Q - - - - 
    - - - Q - 

    N=5 no.63
    - - Q - - 
    - Q - - - 
    - - - Q - 
    - - - - Q 
    Q - - - - 

    N=5 no.64
    - - Q - - 
    - Q - - - 
    - - - Q - 
    Q - - - - 
    - - - - Q 

    N=5 no.65
    - - Q - - 
    - Q - - - 
    Q - - - - 
    - - - - Q 
    - - - Q - 

    N=5 no.66
    - - Q - - 
    - Q - - - 
    Q - - - - 
    - - - Q - 
    - - - - Q 

    N=5 no.67
    - - Q - - 
    Q - - - - 
    - - - - Q 
    - - - Q - 
    - Q - - - 

    N=5 no.68
    - - Q - - 
    Q - - - - 
    - - - - Q 
    - Q - - - 
    - - - Q - 

    N=5 no.69
    - - Q - - 
    Q - - - - 
    - - - Q - 
    - - - - Q 
    - Q - - - 

    N=5 no.70
    - - Q - - 
    Q - - - - 
    - - - Q - 
    - Q - - - 
    - - - - Q 

    N=5 no.71
    - - Q - - 
    Q - - - - 
    - Q - - - 
    - - - - Q 
    - - - Q - 

    N=5 no.72
    - - Q - - 
    Q - - - - 
    - Q - - - 
    - - - Q - 
    - - - - Q 

    N=5 no.73
    - Q - - - 
    - - - - Q 
    - - - Q - 
    - - Q - - 
    Q - - - - 

    N=5 no.74
    - Q - - - 
    - - - - Q 
    - - - Q - 
    Q - - - - 
    - - Q - - 

    N=5 no.75
    - Q - - - 
    - - - - Q 
    - - Q - - 
    - - - Q - 
    Q - - - - 

    N=5 no.76
    - Q - - - 
    - - - - Q 
    - - Q - - 
    Q - - - - 
    - - - Q - 

    N=5 no.77
    - Q - - - 
    - - - - Q 
    Q - - - - 
    - - - Q - 
    - - Q - - 

    N=5 no.78
    - Q - - - 
    - - - - Q 
    Q - - - - 
    - - Q - - 
    - - - Q - 

    N=5 no.79
    - Q - - - 
    - - - Q - 
    - - - - Q 
    - - Q - - 
    Q - - - - 

    N=5 no.80
    - Q - - - 
    - - - Q - 
    - - - - Q 
    Q - - - - 
    - - Q - - 

    N=5 no.81
    - Q - - - 
    - - - Q - 
    - - Q - - 
    - - - - Q 
    Q - - - - 

    N=5 no.82
    - Q - - - 
    - - - Q - 
    - - Q - - 
    Q - - - - 
    - - - - Q 

    N=5 no.83
    - Q - - - 
    - - - Q - 
    Q - - - - 
    - - - - Q 
    - - Q - - 

    N=5 no.84
    - Q - - - 
    - - - Q - 
    Q - - - - 
    - - Q - - 
    - - - - Q 

    N=5 no.85
    - Q - - - 
    - - Q - - 
    - - - - Q 
    - - - Q - 
    Q - - - - 

    N=5 no.86
    - Q - - - 
    - - Q - - 
    - - - - Q 
    Q - - - - 
    - - - Q - 

    N=5 no.87
    - Q - - - 
    - - Q - - 
    - - - Q - 
    - - - - Q 
    Q - - - - 

    N=5 no.88
    - Q - - - 
    - - Q - - 
    - - - Q - 
    Q - - - - 
    - - - - Q 

    N=5 no.89
    - Q - - - 
    - - Q - - 
    Q - - - - 
    - - - - Q 
    - - - Q - 

    N=5 no.90
    - Q - - - 
    - - Q - - 
    Q - - - - 
    - - - Q - 
    - - - - Q 

    N=5 no.91
    - Q - - - 
    Q - - - - 
    - - - - Q 
    - - - Q - 
    - - Q - - 

    N=5 no.92
    - Q - - - 
    Q - - - - 
    - - - - Q 
    - - Q - - 
    - - - Q - 

    N=5 no.93
    - Q - - - 
    Q - - - - 
    - - - Q - 
    - - - - Q 
    - - Q - - 

    N=5 no.94
    - Q - - - 
    Q - - - - 
    - - - Q - 
    - - Q - - 
    - - - - Q 

    N=5 no.95
    - Q - - - 
    Q - - - - 
    - - Q - - 
    - - - - Q 
    - - - Q - 

    N=5 no.96
    - Q - - - 
    Q - - - - 
    - - Q - - 
    - - - Q - 
    - - - - Q 

    N=5 no.97
    Q - - - - 
    - - - - Q 
    - - - Q - 
    - - Q - - 
    - Q - - - 

    N=5 no.98
    Q - - - - 
    - - - - Q 
    - - - Q - 
    - Q - - - 
    - - Q - - 

    N=5 no.99
    Q - - - - 
    - - - - Q 
    - - Q - - 
    - - - Q - 
    - Q - - - 

    N=5 no.100
    Q - - - - 
    - - - - Q 
    - - Q - - 
    - Q - - - 
    - - - Q - 

    N=5 no.101
    Q - - - - 
    - - - - Q 
    - Q - - - 
    - - - Q - 
    - - Q - - 

    N=5 no.102
    Q - - - - 
    - - - - Q 
    - Q - - - 
    - - Q - - 
    - - - Q - 

    N=5 no.103
    Q - - - - 
    - - - Q - 
    - - - - Q 
    - - Q - - 
    - Q - - - 

    N=5 no.104
    Q - - - - 
    - - - Q - 
    - - - - Q 
    - Q - - - 
    - - Q - - 

    N=5 no.105
    Q - - - - 
    - - - Q - 
    - - Q - - 
    - - - - Q 
    - Q - - - 

    N=5 no.106
    Q - - - - 
    - - - Q - 
    - - Q - - 
    - Q - - - 
    - - - - Q 

    N=5 no.107
    Q - - - - 
    - - - Q - 
    - Q - - - 
    - - - - Q 
    - - Q - - 

    N=5 no.108
    Q - - - - 
    - - - Q - 
    - Q - - - 
    - - Q - - 
    - - - - Q 

    N=5 no.109
    Q - - - - 
    - - Q - - 
    - - - - Q 
    - - - Q - 
    - Q - - - 

    N=5 no.110
    Q - - - - 
    - - Q - - 
    - - - - Q 
    - Q - - - 
    - - - Q - 

    N=5 no.111
    Q - - - - 
    - - Q - - 
    - - - Q - 
    - - - - Q 
    - Q - - - 

    N=5 no.112
    Q - - - - 
    - - Q - - 
    - - - Q - 
    - Q - - - 
    - - - - Q 

    N=5 no.113
    Q - - - - 
    - - Q - - 
    - Q - - - 
    - - - - Q 
    - - - Q - 

    N=5 no.114
    Q - - - - 
    - - Q - - 
    - Q - - - 
    - - - Q - 
    - - - - Q 

    N=5 no.115
    Q - - - - 
    - Q - - - 
    - - - - Q 
    - - - Q - 
    - - Q - - 

    N=5 no.116
    Q - - - - 
    - Q - - - 
    - - - - Q 
    - - Q - - 
    - - - Q - 

    N=5 no.117
    Q - - - - 
    - Q - - - 
    - - - Q - 
    - - - - Q 
    - - Q - - 

    N=5 no.118
    Q - - - - 
    - Q - - - 
    - - - Q - 
    - - Q - - 
    - - - - Q 

    N=5 no.119
    Q - - - - 
    - Q - - - 
    - - Q - - 
    - - - - Q 
    - - - Q - 

    N=5 no.120
    Q - - - - 
    - Q - - - 
    - - Q - - 
    - - - Q - 
    - - - - Q 
    count:120
*/
int size;       //ボードサイズ
int mask;       //連続する１ビットのシーケンス N=8: 11111111
int count;      //見つかった解
int aBoard[8];  //表示用配列
// 
//１６進数を２進数に変換
void con(int decimal){
  int _decimal=decimal;
  int binary=0;
  int base=1;
  while(decimal>0){
    binary=binary+(decimal%2)*base;
    decimal=decimal/2;
    base=base*10;
  }
  printf("16進数:\t%d\t2進数:\t%d\n",_decimal,binary);
}
//
//ボード表示用
void Display(void) {
    int  y, bitmap, bit;
    printf("\nN=%d no.%d\n", size, count);
    for (y=0; y<size; y++) {
        bitmap = aBoard[y];
        for (bit=1<<(size-1); bit; bit>>=1)
            printf("%s ", (bitmap & bit)? "Q": "-");
        printf("\n");
    }
}
// y:これまでに配置できたクイーンの数
void backtrack(int y,int left,int down,int right){
  int bitmap=0;
  int bit=0;
  if(y==size){
    count++;
    Display(); //表示
  }else{
    //OR 結果をビット反転
    // mask:11111111 255
    // left 0: down 1: right 0
    // 11111110 254

    /**
     * 斜めを考慮せず、行にクイーンを一つだけ配置できるように考慮
     */
    //bitmap=mask&~(left|down|right);
    //bitmap=mask&~(0); //行も列も斜めも考慮せず配置できる可能性を出力
    bitmap=mask&~(down); //行だけを考慮して配置できる可能性を出力

    while(bitmap){
      // nを２進法で表したときの一番下位のONビットがひとつだけ抽出される結果が
      // 得られるのです。極めて簡単な演算によって1ビット抽出を実現させているこ
      // とが重要です。
      //     00010110   22
      // AND 11101010  -22
      // ------------------
      //     00000010
      bit=-bitmap&bitmap;
      // ここでは配置可能なパターンがひとつずつ生成される(bit) 
      bitmap^=bit;
      aBoard[y]=bit;  // 表示用
      backtrack(y+1,(left|bit)<<1,(down|bit),(right|bit)>>1);
    }
  }
}
int main(){
  size=5; //サイズは５で
  mask=(1<<size)-1;
  backtrack(0,0,0,0);
  printf("count:%d\n",count);
  return 0;
}


